# St7SetSRALoadCaseTable

Specifies the table associated with the specified Spectral Response analysis Load Excitation case.

long St7SetSRALoadCaseTable(long uID, long SRACase, long CaseNum, long TableID)

Input Parameters

uID

Strand7 model file ID.

SRACase

Spectral Response load excitation case number.

CaseNum

Load case number.

TableID

Table ID number, or 0 for none.